---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.SectionNameKey
source: html/21929d86-c079-60d2-7c8d-209c11d9ab1c.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.SectionNameKey Property

A parameter in structural families which allows for family type identification.
 This will be used for data mapping during model exchange with another program, namely Advance Steel.

## Syntax (C#)
```csharp
public string SectionNameKey { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null